dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxPms_bf.h
/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_OFF (6u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_OFF (7u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_OFF (8u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_OFF (9u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_OFF (10u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY0_FE11_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY0_FE11_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY0_FE11_OFF (11u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY0_FE12_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY0_FE12_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY0_FE12_OFF (12u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY0_FE13_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY0_FE13_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY0_FE13_OFF (13u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY0_FE14_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY0_FE14_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY0_FE14_OFF (14u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY0_FE15_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY0_FE15_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY0_FE15_OFF (15u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY0_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY0_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY0_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE0 */
#define IFX_PMS_AGFSP_STDBY1_FE0_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE0 */
#define IFX_PMS_AGFSP_STDBY1_FE0_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE0 */
#define IFX_PMS_AGFSP_STDBY1_FE0_OFF (0u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE1 */
#define IFX_PMS_AGFSP_STDBY1_FE1_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE1 */
#define IFX_PMS_AGFSP_STDBY1_FE1_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE1 */
#define IFX_PMS_AGFSP_STDBY1_FE1_OFF (1u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE2 */
#define IFX_PMS_AGFSP_STDBY1_FE2_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE2 */
#define IFX_PMS_AGFSP_STDBY1_FE2_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE2 */
#define IFX_PMS_AGFSP_STDBY1_FE2_OFF (2u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE3 */
#define IFX_PMS_AGFSP_STDBY1_FE3_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE3 */
#define IFX_PMS_AGFSP_STDBY1_FE3_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE3 */
#define IFX_PMS_AGFSP_STDBY1_FE3_OFF (3u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY1_FE4_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY1_FE4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY1_FE4_OFF (4u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY1_FE5_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY1_FE5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY1_FE5_OFF (5u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY1_FE7_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY1_FE7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY1_FE7_OFF (7u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY1_FE8_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY1_FE8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY1_FE8_OFF (8u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY1_FE9_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY1_FE9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY1_FE9_OFF (9u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY1_FE10_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY1_FE10_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY1_FE10_OFF (10u)

